In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [13]:
employ_file= "DP_LIVE_Employdata.csv"
GDP_file="DP_LIVE_GDPdata.csv"

In [14]:
employ_df = pd.read_csv(employ_file)
employ_df.head()

  LOCATION INDICATOR SUBJECT   MEASURE FREQUENCY  TIME   Value Flag Codes
0      AUS       EMP     MEN  THND_PER         A  1965  3346.5        NaN
1      AUS       EMP     MEN  THND_PER         A  1966  3362.5        NaN
2      AUS       EMP     MEN  THND_PER         A  1967  3412.5        NaN
3      AUS       EMP     MEN  THND_PER         A  1968  3474.0        NaN
4      AUS       EMP     MEN  THND_PER         A  1969  3548.0        NaN

In [17]:
GDP_df=pd.read_csv(GDP_file)
GDP_df.head()

  LOCATION INDICATOR SUBJECT  MEASURE FREQUENCY  TIME       Value Flag Codes
0      AUS       GDP     TOT  MLN_USD         A  1960  25036.1668        NaN
1      AUS       GDP     TOT  MLN_USD         A  1961  25326.3822        NaN
2      AUS       GDP     TOT  MLN_USD         A  1962  27913.2057        NaN
3      AUS       GDP     TOT  MLN_USD         A  1963  30385.7232        NaN
4      AUS       GDP     TOT  MLN_USD         A  1964  32695.8783        NaN

In [16]:
employ_new_df=employ_df[["LOCATION","INDICATOR","SUBJECT","TIME","Value"]]
employ_new_df.head()

  LOCATION INDICATOR SUBJECT  TIME   Value
0      AUS       EMP     MEN  1965  3346.5
1      AUS       EMP     MEN  1966  3362.5
2      AUS       EMP     MEN  1967  3412.5
3      AUS       EMP     MEN  1968  3474.0
4      AUS       EMP     MEN  1969  3548.0

In [10]:
employ_group=employ_new_df.groupby(["LOCATION"])
employ_group